blogs/the-difference-between-ci-and-cd.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-01-11 六 21:46 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>CI和CD的真正区别</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="zzyongx" />
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">CI和CD的真正区别</h1>
<p>
原文 <a href="https://fire.ci/blog/the-difference-between-ci-and-cd/">The real difference between CI and CD</a>
</p>

<p>
在摆弄概念上,我的确是个泥腿子.开发过不少大型项目,但团队规模通常是1-2个人.做架构师的时候,摆弄过jenkins,git接受merge之后触发编译,测试,上线到测试环境,运转的相当不错.
</p>

<p>
对CI和CD望文生意,觉得能做到这样已然不错,实际上我那套jenkins的玩法的确做的不错.我这么自信,基于两段经历.
</p>
<ol class="org-ol">
<li>接手了兄弟部门离职同事的代码,一个人开发,通过REST API和其它功能集成.是的,有CI,每次提交之后自动编译一把,没了,仅此而已.这年头还有人敢在代码编译不过的情况下向主分支提交代码吗?这样的CI有啥用?</li>
<li>技术委员会按照开发语言划分分会,大家有兴趣讨论八页纸的代码格式规范,可是提到CI,竟然也是确保编译能过.</li>
</ol>

<p>
此文解释CI和CD区别的同时,科普了下啥是CI和CD.作笔记如下:
</p>

<div id="outline-container-org2a9831f" class="outline-2">
<h2 id="org2a9831f"><span class="section-number-2">1</span> CI是一个团队问题</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orge936536" class="outline-3">
<h3 id="orge936536"><span class="section-number-3">1.1</span> CI是什么</h3>
<div class="outline-text-3" id="text-1-1">
<p>
CI和工具无关,CI是一种开发方式.每次开发一个小功能(如果功能大,就拆解),开发完成后立即合并到主分支,至少一天commit一次,这样保证合并的代码量很少.如果团队的风格是一次合并大量代码到主分支,CI不CI的也不重要了(看不出哪持续嘛).
</p>

<p>
小功能即合并入主分支,也意味着要频繁把主分支merge到自己的开发分支.如果某个功能并入主分支时导致不能编译,那么所有把主分支merge到自己分支的人都会受影响,团队全阻塞在这个问题上,这个代价是高昂的,这是CI面临的 <b>主要问题</b> .
</p>

<p>
个人观点: 我认为这个问题并不严重,虽然大家都在一个仓库开发,但是功能划分是比较清楚的,所以并不需要频繁从主分支merge,只管向主分支merge就行.
</p>
</div>
</div>

<div id="outline-container-orgaff4d47" class="outline-3">
<h3 id="orgaff4d47"><span class="section-number-3">1.2</span> CI的目标</h3>
<div class="outline-text-3" id="text-1-2">
<p>
考虑到CI面临的问题,CI保证并入主分支的代码正确就非常重要了.然而既然持续集成,每次集成的耗时又不能太多,最好在7分钟完成(干等7分钟是可以接受的,太久就干别的事情去了,当集成出现问题,再把注意力切回来,没那么容易).又要对,又要耗时短,所以CI的目标不是保证正确,只要保证基本正确就行了(编译通过,基本功能能用).
</p>

<p>
个人观点: 基本正确容易理解,把测试分成保证基本正确的和保证正确的,就有点无理取闹了.并且以大部分开发的秉性,耗时久的担心是多余的,因为根本没测试,哈哈.
</p>
</div>
</div>
</div>

<div id="outline-container-orgc79fd12" class="outline-2">
<h2 id="orgc79fd12"><span class="section-number-2">2</span> CD是一个工程问题</h2>
<div class="outline-text-2" id="text-2">
<p>
CI只保证基本正确,那只能靠CD保证正确了.CD阶段要单元测试,集成测试,性能测试等等.
</p>
</div>
</div>

<div id="outline-container-orgdb10d97" class="outline-2">
<h2 id="orgdb10d97"><span class="section-number-2">3</span> 个人总结:</h2>
<div class="outline-text-2" id="text-3">
<p>
结果导向,项目开发无非是正确和效率,能达成这个目标的话,想咋弄咋弄吧.不忘初心,别搞形式主义就行.另外,95%的项目都很小,如果你觉得大,可能只是你觉得大而已.小项目更得务实,别花拳秀腿.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: zzyongx</p>
<p class="date">Created: 2020-01-11 六 21:46</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
